# RoomFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomFilter Constructor
RoomFilter Class See Also
---
Constructs a filter which matches only rooms.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RoomFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RoomFilter()
```

# See Also
RoomFilter Class
Autodesk.Revit.DB.Architecture Namespace